<?php
    #---------------------------------------------------------------------------------
    # debug settings
    #---------------------------------------------------------------------------------
    if (true) {
        ini_set('display_errors', 1);
        ini_set('display_startup_errors', 1);
        error_reporting(E_ALL);
    }
    #---------------------------------------------------------------------------------
    # 
    #---------------------------------------------------------------------------------
    require $_SERVER['DOCUMENT_ROOT'] . '/db/utils.php';
    #---------------------------------------------------------------------------------
    # check autorization
    #---------------------------------------------------------------------------------
    !isAuthorized() && die(err2echo(23, '', ''));
    #---------------------------------------------------------------------------------
    # connect to db
    #---------------------------------------------------------------------------------
    require $_SERVER['DOCUMENT_ROOT'] . '/db/conn.php';
    #---------------------------------------------------------------------------------
    # 
    #---------------------------------------------------------------------------------
    isset($_GET["name"]) ? $name = $_GET["name"] : $name = "";
    isset($_GET["tel"])  ? $tel  = $_GET["tel"]  : $tel  = "";
    isset($_GET["city"]) ? $city = $_GET["city"] : $city = "";
    isset($_GET["info"]) ? $city = $_GET["info"] : $info = "";
    #
    $tel = preg_replace('~\D+~', '', $tel);
    #---------------------------------------------------------------------------------
    # 
    #---------------------------------------------------------------------------------
    $query = 'SELECT * FROM pb001 WHERE name = ? tel = ? city = ?';
    #
    !($stmt = $mysqli->prepare($query))             && die(err2echo(10, 'Обновление контакта. ', $mysqli));
    !($stmt->bind_param('sis', $name, $tel, $city)) && die(err2echo(11, 'Обновление контакта. ', $mysqli));
    !($stmt->execute())                             && die(err2echo(12, 'Обновление контакта. ', $mysqli));
    !($result = $stmt->get_result())                && die(err2echo(15, 'Обновление контакта. ', $mysqli));   
    $rows = []; 
    while($row = $result->fetch_assoc()) {
        $rows[] = $row;
    }
    #
    $data['old'] = $rows;
    #
    $stmt->free_result();
    $stmt->close();
    #---------------------------------------------------------------------------------
    # 
    #---------------------------------------------------------------------------------
    $id = $rows[0]['id'];
    $query = "UPDATE pb001 SET name = ?, tel = ?, city = ?, info = ? WHERE id = ?";
    #
    !($stmt = $mysqli->prepare($query))                             && die(err2echo(10, 'Обновление контакта. ', $mysqli));
    !($stmt->bind_param('sissssi', $name, $tel, $city, $info, $id)) && die(err2echo(11, 'Обновление контакта. ', $mysqli));
    !($stmt->execute())                                             && die(err2echo(12, 'Обновление контакта. ', $mysqli));
    #---------------------------------------------------------------------------------
    # 
    #---------------------------------------------------------------------------------
    $query = "SELECT * FROM pb001 WHERE id = ?";
    #
    !($stmt = $mysqli->prepare($query)) && die(err2echo(10, 'Обновление контакта. ', $mysqli));
    !($stmt->bind_param('i', $id))      && die(err2echo(11, 'Обновление контакта. ', $mysqli));
    !($stmt->execute())                 && die(err2echo(12, 'Обновление контакта. ', $mysqli));
    !($result = $stmt->get_result())    && die(err2echo(15, 'Обновление контакта. ', $mysqli));   
    $rows = []; 
    while($row = $result->fetch_assoc()) {
        $rows[] = $row;
    }
    #
    $data['new'] = $rows;
    #
    $stmt->free_result();
    $stmt->close();
    #---------------------------------------------------------------------------------
    # 
    #---------------------------------------------------------------------------------
    $data['status'] = true;
    echo json_encode($data);
    #---------------------------------------------------------------------------------
    # 
    #---------------------------------------------------------------------------------
    $mysqli->close();
?>