<?php
    #---------------------------------------------------------------------------------
    # debug settings
    #---------------------------------------------------------------------------------
    if (true) {
        ini_set('display_errors', 1);
        ini_set('display_startup_errors', 1);
        error_reporting(E_ALL);
    }
    #---------------------------------------------------------------------------------
    # 
    #---------------------------------------------------------------------------------
    require $_SERVER['DOCUMENT_ROOT'] . '/db/utils.php';
    #---------------------------------------------------------------------------------
    # check autorization
    #---------------------------------------------------------------------------------
    !isAuthorized() && die(err2echo(23, '', ''));
    #---------------------------------------------------------------------------------
    # connect to db
    #---------------------------------------------------------------------------------
    require $_SERVER['DOCUMENT_ROOT'] . '/db/conn.php';
    #---------------------------------------------------------------------------------
    # get values
    #---------------------------------------------------------------------------------
    $year  = isset($_GET["year"])  ? $_GET["year"]  : 1900;
    $month = isset($_GET["month"]) ? $_GET["month"] : 12;
    $unid = isset($_GET["unid"]) ? $_GET["unid"] : -1;
    #
    $dbeg = $year . "-" . $month . "-" . 01;
    $dend = $year . "-" . $month . "-" . cal_days_in_month(CAL_GREGORIAN, intval($month), intval($year));
    #
    $where = ($unid != -1) ? "unid = ?" : "dend >= ? AND dbeg <= ?";
    #---------------------------------------------------------------------------------
    # get guest list
    #---------------------------------------------------------------------------------
    $query = "SELECT * FROM gl001 WHERE" ." " . $where;
    #
    !($stmt = $mysqli->prepare($query))          && die(err2echo(10, "Выборка Список гостей. ", $mysqli));
    if ($unid != -1) {//TODO: dynamic bindparam
        !($stmt->bind_param('i', $unid))         && die(err2echo(11, "Выборка Список гостей. ", $mysqli));
    } else {
        !($stmt->bind_param('ss', $dbeg, $dend)) && die(err2echo(11, "Выборка Список гостей. ", $mysqli));
    }
    !($stmt->execute())                          && die(err2echo(12, "Выборка Список гостей. ", $mysqli));   
    !($result = $stmt->get_result())             && die(err2echo(15, "Выборка Список гостей. ", $mysqli)); 
    #
    $rows = []; 
    while($row = $result->fetch_assoc()) {
        $rows[] = $row;
    }
    #
    $data['data'] = $rows;
    #
    $data['total'] = mysqli_num_rows($result);
    #
    $data['year'] = $year;
    $data['month'] = $month;
    #---------------------------------------------------------------------------------
    # close connection
    #---------------------------------------------------------------------------------
    $stmt->free_result();
    $stmt->close();
    #---------------------------------------------------------------------------------
    # 
    #---------------------------------------------------------------------------------
    $mysqli->close();
    #---------------------------------------------------------------------------------
    # send result
    #---------------------------------------------------------------------------------
    $data['status'] = true;
    echo json_encode($data);
?>